src/main/resources/templates/smartpay/SmartpayAuthoriseOrderTemplate.xml

<?xml version="1.0"?>
<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ns1="http://payment.services.adyen.com"
        xmlns:ns2="http://common.services.adyen.com">
    <soap:Body>
        <ns1:authorise>
            <ns1:paymentRequest>
                <ns1:amount>
                    <ns2:currency>GBP</ns2:currency>
                    <ns2:value>${amount}</ns2:value>
                </ns1:amount>
                <ns1:card>
                    <ns1:cvc>${authorisationDetails.cvc}</ns1:cvc>
                    <ns1:expiryMonth>${authorisationDetails.endDate?split('/')?first}</ns1:expiryMonth>
                    <ns1:expiryYear>20${authorisationDetails.endDate?split('/')?last}</ns1:expiryYear>
                    <ns1:holderName>${authorisationDetails.cardHolder?xml}</ns1:holderName>
                    <ns1:number>${authorisationDetails.cardNo}</ns1:number>
                    <ns1:billingAddress>
                        <ns2:houseNumberOrName>${authorisationDetails.address.line1?xml}</ns2:houseNumberOrName>
                        <ns2:street><#if authorisationDetails.address.line2??>${authorisationDetails.address.line2?xml}</#if></ns2:street>
                        <ns2:postalCode>${authorisationDetails.address.postcode?xml}</ns2:postalCode>
                        <ns2:stateOrProvince><#if authorisationDetails.address.county??>${authorisationDetails.address.county?xml}</#if></ns2:stateOrProvince>
                        <ns2:city>${authorisationDetails.address.city?xml}</ns2:city>
                        <ns2:country>${authorisationDetails.address.country?xml}</ns2:country>
                    </ns1:billingAddress>
                  </ns1:card>
                <ns1:merchantAccount>${merchantCode}</ns1:merchantAccount>
                <ns1:reference>${paymentPlatformReference?xml}</ns1:reference>
                <ns1:shopperReference>${description?xml}</ns1:shopperReference>
            </ns1:paymentRequest>
        </ns1:authorise>
    </soap:Body>
</soap:Envelope>
